Table of Contents
 Class CheckMember
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Check member base class
public abstract class CheckMember : OpenElementId
Inheritance
object
OpenObject
OpenElementId
CheckMember
Derived
CheckMember1D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CheckMember()
Constructor
public CheckMember()
Properties
 Name
Name of Element
public string Name { get; set; }
Property Value
string
 Edit this page